v1.15 diagrams docs fix
